MAIN_MENU_BUTTON = '📋 Главное меню администратора'
USERS_BUTTON = 'Пользователи 👨‍💼'
RESTAURANTS_BUTTON = 'Рестораны 🏛️'
ROADMAPS_BUTTON = 'Дорожные карты 📈'
TESTS_BUTTON = 'Тесты 📍'
USERS_LIST_BUTTON = 'Все пользователи 👥'
CREATE_USER_BUTTON = 'Создать ➕'
BACK_BUTTON = 'Назад ⬅️'
BACK_TO_MAIN_BUTTON = 'Отмена 🛑'
RESTAURANTS_LIST_BUTTON = 'Все рестораны 🏛️'
CREATE_REST_BUTTON = 'Создать ресторан ➕'
ROADMAPS_LIST_BUTTON = 'Все дорожные карты'
CREATE_ROADMAP_BUTTON = 'Создать ДК'
TESTS_LIST_BUTTON = 'Все тесты 📚'
CREATE_TEST_BUTTON = 'Создать тест ➕'
ADMIN_ROLE_BUTTON = 'Админ 💻'
INTERN_ROLE_BUTTON = 'Стажер 🙆'
ACTIVE_USER_BUTTON = 'Активен 🟢'
DEACTIVE_USER_BUTTON = 'Неактивен 🔴'

MAIN_MENU_ADMIN = (
    'Здесь вы можете управлять: \n - Пользователями \n  \n Выберите нужный пункт меню:'
    )

ADMIN_USERS_MENU_TEXT = (
    'В данном пункте меню вы можете создать нового '
    'пользователя либо изменить профиль уже '
    'зарегистрированного. \n \n Для изменения данных '
    'пользователя перейдите в пункт меню '
    '"Все пользователи 👥" и выберите нужный профиль'
    )

ADMIN_RESTAURANTS_MENU_TEXT = (
    'В данном пункте меню вы можете добавить новый '
    'ресторан либо изменить данные уже созданного. \n \n'
    'Для изменения данных перейдите в пункт меню '
    '"Все рестораны 🏛️" и выберите необходимое заведение.'
    )

ADMIN_ROADMAPS_MENU_TEXT = (
    'В данном пункте меню вы можете создать дорожную карту, '
    'для этого перейдите в раздел "Создать ДК". \n \n'
    'Для изменения данных  дорожной карты перейдите в пункт меню '
    '"Все дорожные карты" и выберите необходимую.'
    )

ADMIN_TESTS_MENU_TEXT = (
    'В данном разделе вы можете создать тестовое задание, '
    'для этого перейдите в пункт меню "Создать тест". \n \n'
    'Для изменения уже имеющегося теста перейдите в пункт меню '
    '"Все тесты" и выберите необходимый.'
    )
